data_generation/simulation_results/of/case_41/constant/simParams
nIter 2000;
hComponent0 1096.600729526664;
hComponent1 1173.6070000581199;
hComponent2 921.0766354779721;
hComponent3 501.45299306688605;
hComponent4 884.7772771179095;kComponent0 71.65502159531778;
kComponent1 72.7226537210525;
kComponent2 60.55364549540619;
kComponent3 63.24385893179636;
kComponent4 94.89884527407986;
tAmbient 300;
Ux 0.9982695893276889;
kPCB 0.38946965260365807;